<template>
<div>
    <h4 class="page-title">Как получить баллы</h4>
    <div class="card-container">    
        <Card v-for="(card, index) in cards" :key="index" :CardData="card"></Card>
    </div>
</div>
    
</template>
<script>
import Card from './components/card.vue'
export default {
    name:'getScore',
    components:{
        Card
    },
    data(){
        return {
            cards:[
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером на международной конференции по своему направлению'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером в Колёсах и на meetup других компаний. Расскажи о наших продуктах и технологиях которые мы используем'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером на международной конференции по своему направлению'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером в Колёсах и на meetup других компаний. Расскажи о наших продуктах и технологиях которые мы используем'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером на международной конференции по своему направлению'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером в Колёсах и на meetup других компаний. Расскажи о наших продуктах и технологиях которые мы используем'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером на международной конференции по своему направлению'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером в Колёсах и на meetup других компаний. Расскажи о наших продуктах и технологиях которые мы используем'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером на международной конференции по своему направлению'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером в Колёсах и на meetup других компаний. Расскажи о наших продуктах и технологиях которые мы используем'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером на международной конференции по своему направлению'
                },
                {
                    title:'Выступление на конференциях',
                    scores: 90,
                    text:'Стань спикером в Колёсах и на meetup других компаний. Расскажи о наших продуктах и технологиях которые мы используем'
                },
            ]
        }
    }
}
</script>
<style lang="scss">
    .page-title{
        font-family: Open Sans;
        font-style: normal;
        font-weight: 600;
        font-size: 20px;
        line-height: 32px;
        margin-bottom: 16px;
    }
    .card-container{
        display: grid;
        column-gap: 24px;
        row-gap: 24px;
        grid-template-columns: 1fr 1fr 1fr;
    }
</style>